#include <iostream>
#include <string>
#include <windows.h>
using namespace std;

void n1()
{
    cout << "Введите последовательно номер дня и месяца, чтобы получить дату в виде текста\n";
    int d1, m1;
    string d2, m2;
    cin >> d1 >> m1;
    if (d1 == 1)
    {
        d2 = "первое ";
    }
    if (d1 == 2)
    {
        d2 = "второе ";
    }
    if (d1 == 3)
    {
        d2 = "третье ";
    }
    if (d1 == 4)
    {
        d2 = "четвёртое ";
    }
    if (d1 == 5)
    {
        d2 = "пятое ";
    }
    if (d1 == 6)
    {
        d2 = "шестое ";
    }
    if (d1 == 7)
    {
        d2 = "седьмое ";
    }
    if (d1 == 8)
    {
        d2 = "восьмое ";
    }
    if (d1 == 9)
    {
        d2 = "девятое ";
    }
    if (d1 == 10)
    {
        d2 = "десятое ";
    }
    if (d1 == 11)
    {
        d2 = "одиннадцатое ";
    }
    if (d1 == 12)
    {
        d2 = "двенадцатое ";
    }
    if (d1 == 13)
    {
        d2 = "тринадцатое ";
    }
    if (d1 == 14)
    {
        d2 = "четырнадцатое ";
    }
    if (d1 == 15)
    {
        d2 = "пятнадцатое ";
    }
    if (d1 == 16)
    {
        d2 = "шестнадцатое ";
    }
    if (d1 == 17)
    {
        d2 = "семнадцатое ";
    }
    if (d1 == 18)
    {
        d2 = "восемнадцатое ";
    }
    if (d1 == 19)
    {
        d2 = "девятнадцатое ";
    }
    if (d1 == 20)
    {
        d2 = "двадцатое ";
    }
    if (d1 == 21)
    {
        d2 = "двадцать первое ";
    }
    if (d1 == 22)
    {
        d2 = "двадцать второе ";
    }
    if (d1 == 23)
    {
        d2 = "двадцать третье ";
    }
    if (d1 == 24)
    {
        d2 = "двадцать четвёртое ";
    }
    if (d1 == 25)
    {
        d2 = "двадцать пятое ";
    }
    if (d1 == 26)
    {
        d2 = "двадцать шестое ";
    }
    if (d1 == 27)
    {
        d2 = "двадцать седьмое ";
    }
    if (d1 == 28)
    {
        d2 = "двадцать восьмое ";
    }
    if (d1 == 29)
    {
        d2 = "двадцать девятое ";
    }
    if (d1 == 30)
    {
        d2 = "тридцатое ";
    }
    if (d1 == 31)
    {
        d2 = "тридцать первое ";
    }
    if (m1 == 1)
    {
        m2 = "января\n";
    }
    if (m1 == 2)
    {
        m2 = "февраля\n";
    }
    if (m1 == 3)
    {
        m2 = "марта\n";
    }
    if (m1 == 4)
    {
        m2 = "апреля\n";
    }
    if (m1 == 5)
    {
        m2 = "мая\n";
    }
    if (m1 == 6)
    {
        m2 = "июня\n";
    }
    if (m1 == 7)
    {
        m2 = "июля\n";
    }
    if (m1 == 8)
    {
        m2 = "августа\n";
    }
    if (m1 == 9)
    {
        m2 = "сентября\n";
    }
    if (m1 == 10)
    {
        m2 = "октября\n";
    }
    if (m1 == 11)
    {
        m2 = "ноября\n";
    }
    if (m1 == 12)
    {
        m2 = "декабря\n";
    }
    cout << d2 << m2;
}

void n2()
{
    cout << "Введите последовательно исходное направление робота(с - север, з - запад и т.д.) и команду\n(0 - продолжать движение, 1 - поворот налево, -1 - поворот направо\n";
    int N;
    string Ci, Ck;
    cin >> Ci >> N;
    if (Ci == "С")
    {
        switch (N)
        {
            case 0:
                cout << "Направление робота после полученной команды - Север\n";
                break;
            case 1:
                cout << "Направление робота после полученной команды - Запад\n";
                break;
            case -1:
                cout << "Направление робота после полученной команды - Восток\n";
                break;
        }
    }
    if (Ci == "З")
    {
        switch (N)
        {
        case 0:
            cout << "Направление робота после полученной команды - Запад\n";
            break;
        case 1:
            cout << "Направление робота после полученной команды - Юг\n";
            break;
        case -1:
            cout << "Направление робота после полученной команды - Север\n";
            break;
        }
    }
    if (Ci == "Ю")
    {
        switch (N)
        {
        case 0:
            cout << "Направление робота после полученной команды - Юг\n";
            break;
        case 1:
            cout << "Направление робота после полученной команды - Восток\n";
            break;
        case -1:
            cout << "Направление робота после полученной команды - Запад\n";
            break;
        }
    }
    if (Ci == "В")
    {
        switch (N)
        {
        case 0:
            cout << "Направление робота после полученной команды - Восток\n";
            break;
        case 1:
            cout << "Направление робота после полученной команды - Север\n";
            break;
        case -1:
            cout << "Направление робота после полученной команды - Юг\n";
            break;
        }
    }
}

void n3()
{
    cout << "Введите целое число в диапазоне 10-40, чтобы вывести строку описание\nНапример: восемнадцать учебных заданий\n";
    int x;
    string y1, y2, y3, x10, x20, x30, x40, x1, x2, x3, x4, x5, x6, x7, x8, x9, x01, x11;
    cin >> x;
    y1 = "учебных заданий";
    y2 = "учебное задание";
    y3 = "учебных задания";
    x10 = "десять";
    x20 = "двадцать";
    x30 = "тридцать";
    x40 = "сорок";
    x01 = "надцать";
    x1 = "один";
    x11 = "одно";
    x2 = "два";
    x3 = "три";
    x4 = "четыре";
    x5 = "пять";
    x6 = "шесть";
    x7 = "семь";
    x8 = "восемь";
    x9 = "девять";
    if (x >= 10 and x <= 40)
    {
        if (x % 10 == 0)
        {
            switch (x)
            {
            case 10:
                cout << x10 << " " << y1 << endl;
                break;
            case 20:
                cout << x20 << " " << y1 << endl;
                break;
            case 30:
                cout << x30 << " " << y1 << endl;
                break;
            case 40:
                cout << x40 << " " << y1 << endl;
                break;
            }
        }
        if (x >= 11 and x <= 19)
        {
            switch (x)
            {
            case 11:
                cout << x1 << x01 << " " << y1 << endl;
                break;
            case 12:
                cout << "две" << x01 << " " << y1 << endl;
                break;
            case 13:
                cout << x3 << x01 << " " << y1 << endl;
                break;
            case 14:
                cout << "четыр" << x01 << " " << y1 << endl;
                break;
            case 15:
                cout << "пят" << x01 << " " << y1 << endl;
                break;
            case 16:
                cout << "шест" << x01 << " " << y1 << endl;
                break;
            case 17:
                cout << "сем" << x01 << " " << y1 << endl;
                break;
            case 18:
                cout << "восем" << x01 << " " << y1 << endl;
                break;
            case 19:
                cout << "девят" << x01 << " " << y1 << endl;
                break;
            }
        }
        if (x % 10 == 1 and x != 11)
        {
            switch (x)
            {
            case 21:
                cout << x20 << " " << x11 << " " << y2 << endl;
                break;
            case 31:
                cout << x30 << " " << x11 << " " << y2 << endl;
                break;
            }
        }
        if (x % 10 == 2 or x % 10 == 3 or x % 10 == 4)
        {
            if (x >= 22 and x <= 24)
            {
                switch (x)
                {
                case 22:
                    cout << x20 << " " << x2 << " " << y3 << endl;
                    break;
                case 23:
                    cout << x20 << " " << x3 << " " << y3 << endl;
                    break;
                case 24:
                    cout << x20 << " " << x4 << " " << y3 << endl;
                    break;
                }
            }
            if (x >= 32 and x <= 34)
            {
                switch (x)
                {
                case 32:
                    cout << x30 << " " << x2 << " " << y3 << endl;
                    break;
                case 33:
                    cout << x30 << " " << x3 << " " << y3 << endl;
                    break;
                case 34:
                    cout << x30 << " " << x4 << " " << y3 << endl;
                    break;
                }
            }
        }
        if (x % 10 == 5 or x % 10 == 6 or x % 10 == 7 or x % 10 == 8 or x % 10 == 9)
        {
            if (x >= 25 and x <= 29)
            {
                switch (x)
                {
                case 25:
                    cout << x20 << " " << x5 << " " << y1 << endl;
                    break;
                case 26:
                    cout << x20 << " " << x6 << " " << y1 << endl;
                    break;
                case 27:
                    cout << x20 << " " << x7 << " " << y1 << endl;
                    break;
                case 28:
                    cout << x20 << " " << x8 << " " << y1 << endl;
                    break;
                case 29:
                    cout << x20 << " " << x9 << " " << y1 << endl;
                    break;
                }
            }
            if (x >= 35 and x <= 39)
            {
                switch (x)
                {
                case 35:
                    cout << x30 << " " << x5 << " " << y1 << endl;
                    break;
                case 36:
                    cout << x30 << " " << x6 << " " << y1 << endl;
                    break;
                case 37:
                    cout << x30 << " " << x7 << " " << y1 << endl;
                    break;
                case 38:
                    cout << x20 << " " << x8 << " " << y1 << endl;
                    break;
                case 39:
                    cout << x20 << " " << x9 << " " << y1 << endl;
                    break;
                }
            }
        }
    }
    else
    {
        cout << "Введённое число находится вне диапазона\n";
    }
}

void n4()
{
    cout << "Введите целое цисло в диапазоне 100-999, чтобы вывести строку-описание\nНапример: 256 - двести пятьдесят шесть\n";
    int x, x100, x10, x1;
    string y100, y10, y1;
    cin >> x;
    if (x >= 100 and x <= 999)
    {
        x100 = x / 100;
        x10 = (x - x100 * 100) / 10;
        x1 = x - x100 * 100 - x10 * 10;
        switch (x100) 
        {
        case 1:
            cout << "сто ";
            break;
        case 2:
            cout << "двести ";
            break;
        case 3:
            cout << "триста ";
            break;
        case 4:
            cout << "четыреста ";
            break;
        case 5:
            cout << "пятьсот ";
            break;
        case 6:
            cout << "шестьсот ";
            break;
        case 7:
            cout << "семьсот ";
            break;
        case 8:
            cout << "восемьсот ";
            break;
        case 9:
            cout << "девятьсот ";
            break;
        }
        if ((x10 * 10 + x1) >= 10 and (x10 * 10 + x1) <= 19)
        {
            if (x10 * 10 + x1 == 11)
            {
                cout << "одиннадцать ";
            }
            if (x10 * 10 + x1 == 12)
            {
                cout << "двенадцать ";
            }
            if (x10 * 10 + x1 == 13)
            {
                cout << "тринадцать ";
            }
            if (x10 * 10 + x1 == 14)
            {
                cout << "четырнадцать ";
            }
            if (x10 * 10 + x1 == 15)
            {
                cout << "пятнадцать ";
            }
            if (x10 * 10 + x1 == 16)
            {
                cout << "шестнадцать ";
            }
            if (x10 * 10 + x1 == 17)
            {
                cout << "семнадцать ";
            }
            if (x10 * 10 + x1 == 18)
            {
                cout << "восемнадцать ";
            }
            if (x10 * 10 + x1 == 19)
            {
                cout << "девятнадцать ";
            }
        }
        else
        {
            if (x10 == 1)
                {
                    cout << "десять ";
                }
            if (x10 == 2)
                {
                    cout << "двадцать ";
                }
            if (x10 == 3)
                {
                    cout << "тридцать ";
                }
            if (x10 == 4)
                {
                    cout << "сорок ";
                }
            if (x10 == 5)
                {
                    cout << "пятьдесят ";
                }
            if (x10 == 6)
                {
                    cout << "шестьдесят ";
                }
            if (x10 == 7)
                {
                    cout << "семьдесят ";
                }
            if (x10 == 8)
                {
                    cout << "восемьдесят ";
                }
            if (x10 == 9)
                {
                    cout << "девяносто ";
                }
        }
        if (x1 == 1)
        {
            cout << "один ";
        }
        if (x1 == 2)
        {
            cout << "два ";
        }
        if (x1 == 3)
        {
            cout << "три ";
        }
        if (x1 == 4)
        {
            cout << "четыре ";
        }
        if (x1 == 5)
        {
            cout << "пять ";
        }
        if (x1 == 6)
        {
            cout << "шесть ";
        }
        if (x1 == 7)
        {
            cout << "семь ";
        }
        if (x1 == 8)
        {
            cout << "восемь ";
        }
        if (x1 == 9)
        {
            cout << "девять ";
        }
    }
}

void n5()
{
    cout << "Введите год, чтобы узнать цвет и животное этого года\n";
    string colors[] = { "зелёной(ого)", "красной(ого)", "жёлтой(ого)", "белой(ого)", "чёрной(ого)" };
    string animals[] = { "крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезьяны", "курицы", "собаки", "свиньи" };
    int n, i, c, a;
    i = 1984;
    a = c = 0;
    cin >> n;
    if (n > 1984)
    {
        while (n != i)
        {
            i++;
            a = a + 1;
            if (a == 12)
            {
                a = 0;
                c = c + 1;
                if (c == 5) 
                {
                    c = 0;
                }
            }
        }
        cout << n << " является годом " << colors[c] << " " << animals[a] << endl;
    }
    if (n < 1984)
    {
        while (n != i)
        {
            i--;
            a = a - 1;
            if (a == -12)
            {
                a = 0;
                c = c - 1;
                if (c == -5)
                {
                    c = 0;
                }
            }
        }
        a = 12 + a;
        c = 4 + c;
        cout << n << " является годом " << colors[c] << " " << animals[a] << endl;
    }
    if (n == 1984)
    {
        cout << "1984 является годом зелёной(ого) крысы\n";
    }
}

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    
    int n0 = 0;
    int k = -1;
    while (k != 0)
    {
        cout << "\nВведите номер задания Лабораторной №12\n\n";
        cin >> n0;
        if (n0 == 0)
        {
            cout << "Выход из программы...\nСпасибо, что засчитали лабораторную!\n";
            k = 0;
        }
        if (n0 == 1)
        {
            n1();
        }
        if (n0 == 2)
        {
            n2();
        }
        if (n0 == 3)
        {
            n3();
        }
        if (n0 == 4)
        {
            n4();
        }
        if (n0 == 5)
        {
            n5();
        }
    }
}